backend/build-up-api/app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    categories = Category.all

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    category = Category.find_by(id: params[:id])

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Easter"], ["created_at", "2020-10-08 18:01:26.292595"], ["updated_at", "2020-10-08 18:01:26.292595"]]
---
def create
  #brings in exerience attributes from params and then adds categories separately
  category = Category.new(cat_params)

  #Tests to make sure the data passed to create the experience is valid
  if category.save

SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Birthdays"], ["LIMIT", 1]]
SELECT "experiences".* FROM "experiences" INNER JOIN "categories_experiences" ON "experiences"."id" = "categories_experiences"."experience_id" WHERE "categories_experiences"."category_id" = ?  [["category_id", 1]]
SELECT "categories".* FROM "categories" WHERE (Birthdays)
SELECT 1 AS one FROM "categories" WHERE (name = 'Love') LIMIT ?  [["LIMIT", 1]]
---
def search
  terms = params[:search][:terms]
  category = Category.where('name = ?', terms)
  results = category[0].experiences if !category.nil?
  binding.pry()
  if !category.empty?