backend/build-up-api/app/controllers/categories_controller.rb

def categories_search
  category = Category.find_by(name: params[:terms])
---
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Birthdays"], ["LIMIT", 1]]