backend/build-up-api/app/controllers/experiences_controller.rb

  def index
    experiences = Experience.all
---
SELECT "experiences".* FROM "experiences"

  def show
    experience = Experience.find_by(id: params[:id])
---
SELECT "experiences".* FROM "experiences" WHERE "experiences"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

def create

  experience = Experience.new(exp_params)
  #figure out if you need to put the categories in as an array of strings, or as category objects
  if experience.save
---
INSERT INTO "experiences" ("title", "description", "location", "date", "coordinates", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  scope = params[:search][:scope] + ' = ?'
  terms = params[:search][:terms]
  result = Experience.where(scope, terms)
---
SELECT "experiences".* FROM "experiences" WHERE (location = 'Crested Butte, CO')

def newest
  results = Experience.order(created_at: :desc).limit(5)
---
SELECT "experiences".* FROM "experiences" ORDER BY "experiences"."created_at" DESC LIMIT ?  [["LIMIT", 5]]